{
  "_name_or_path": "/home/mini_server/PycharmProjects/issac/bullet_test/segformer-b0-finetuned-bullets/checkpoint-14700",
  "architectures": [
    "SegformerForSemanticSegmentation"
  ],
  "attention_probs_dropout_prob": 0.0,
  "classifier_dropout_prob": 0.1,
  "decoder_hidden_size": 256,
  "depths": [
    2,
    2,
    2,
    2
  ],
  "downsampling_rates": [
    1,
    4,
    8,
    16
  ],
  "drop_path_rate": 0.1,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_sizes": [
    32,
    64,
    160,
    256
  ],
  "id2label": {
    "0": "unlabeled",
    "1": "breech-face",
    "2": "aperture-shear",
    "3": "firing-pin-impression",
    "4": "firing-pin-drag",
    "5": "other"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "label2id": {
    "aperture-shear": 2,
    "breech-face": 1,
    "firing-pin-drag": 4,
    "firing-pin-impression": 3,
    "other": 5,
    "unlabeled": 0
  },
  "layer_norm_eps": 1e-06,
  "mlp_ratios": [
    4,
    4,
    4,
    4
  ],
  "model_type": "segformer",
  "num_attention_heads": [
    1,
    2,
    5,
    8
  ],
  "num_channels": 3,
  "num_encoder_blocks": 4,
  "patch_sizes": [
    7,
    3,
    3,
    3
  ],
  "reshape_last_stage": true,
  "semantic_loss_ignore_index": 255,
  "sr_ratios": [
    8,
    4,
    2,
    1
  ],
  "strides": [
    4,
    2,
    2,
    2
  ],
  "torch_dtype": "float32",
  "transformers_version": "4.36.2"
}
